-- MySQL dump 10.13  Distrib 5.5.41, for Win64 (x86)
--
-- Host: localhost    Database: hhlab
-- ------------------------------------------------------
-- Server version	5.5.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `book`
--

DROP TABLE IF EXISTS `book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book` (
  `class` char(2) DEFAULT NULL,
  `subclass` char(5) DEFAULT NULL,
  `cover` varchar(63) DEFAULT NULL,
  `title` varchar(31) NOT NULL,
  `pinyin` varchar(127) DEFAULT NULL,
  `author` varchar(31) DEFAULT NULL,
  `isbn13` char(13) NOT NULL,
  `isbn10` char(10) DEFAULT NULL,
  `preface` text,
  `contents` text,
  `press` varchar(31) DEFAULT NULL,
  `version` varchar(31) DEFAULT NULL,
  `introduction` text,
  `storage` int(16) NOT NULL DEFAULT '0',
  `storage_cb` int(16) NOT NULL DEFAULT '0',
  `grade_times` int(16) NOT NULL DEFAULT '0',
  `grade_ave` double NOT NULL DEFAULT '1',
  PRIMARY KEY (`isbn13`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES ('A','A1','https://img1.doubanio.com/mpic/s1070959.jpg','红楼梦','hongloumeng','[清] 曹雪芹 著,高鹗 续','9787020002207','702000220X','','','人民文学出版社','','《红楼梦》是一部百科全书式的长篇小说。以宝黛爱情悲剧为主线，以四大家族的荣辱兴衰为背景，描绘出18世纪中国封建社会的方方面面，以及封建专制下新兴资本主义民主思想的萌动。结构宏大、情节委婉、细节精致，人物形象栩栩如生，声口毕现，堪称中国古代小说中的经 典。\n由红楼梦研究所校注、人民文学出版社出版的《红楼梦》以庚辰（1760）本《脂砚斋重评石头记》为底本，以甲戌（1754）本、已卯（1759）本、蒙古王府本、戚蓼生序本、舒元炜序本、郑振铎藏本、红楼梦稿本、列宁格勒藏本（俄藏本）、程甲本、程乙本等众多版本为参校本，是一个博采众长、非常适合大众阅读的本子；同时，对底本的重要修改，皆出校记，读者可因以了解《红楼梦》的不同版本状况。\n红学所的校注本已印行二十五年，其间1994年曾做过一次修订，又十几年过去，2008年推出修订第三版，体现了新的校注成果和科研成果。\n关于《红楼梦》的作者，原本就有多种说法及推想，“前八十回曹雪芹著、后四十回高鹗续”的说法只是其中之一，这次修订中校注者改为“前八十回曹雪芹著；后四十回无名氏续，程伟元、高鹗整理”，应当是一种更科学的表述，体现了校注者对这一问题的新的认识。\n现在这个修订后的《红楼梦》是更加完善。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s1070222.jpg','围城','weicheng','钱锺书','9787020024759','7020024750','','','人民文学出版社','','《围城》是钱钟书所著的长篇小说。第一版于1947年由上海晨光出版公司出版。1949年之后，由于政治等方面的原因，本书长期无法在中国大陆和台湾重印，仅在香港出现过盗印本。1980年由作者重新修订之后，在中国大陆地区由人民文学出版社刊印。此后作者又曾小幅修改过几次。《围城》自从出版以来，就受到许多人的推重。由于1949年后长期无法重印，这本书逐渐淡出人们的视野。1960年代，旅美汉学家夏志清在《中国现代小说史》(A History of Modern Chinese Fiction)中对本书作出很高的评价，这才重新引起人们对它的关注。人们对它的评价一般集中在两方面，幽默的语言和对生活深刻的观察。从1990年代开始，也有人提出对本书的不同看法，认为这是一部被“拔高”的小说，并不是一部出色的作品。很多人认为这是一部幽默作品。除了各具特色的人物语言之外，作者夹叙其间的文字也显着机智与幽默。这是本书的一大特色。也有人认为这是作者卖弄文字，语言显得尖酸刻薄。但这一说法并不为大多数人接受。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s1237549.jpg','小王子','xiaowangzi','[法] 圣埃克苏佩里','9787020042494','702004249X','','','人民文学出版社','','小王子是一个超凡脱俗的仙童，他住在一颗只比他大一丁点儿的小行星上。陪伴他的是一朵他非常喜爱的小玫瑰花。但玫瑰花的虚荣心伤害了小王子对她的感情。小王子告别小行星，开始了遨游太空的旅行。他先后访问了六个行星，各种见闻使他陷入忧伤，他感到大人们荒唐可笑、太不正常。只有在其中一个点灯人的星球上，小王子才找到一个可以作为朋友的人。但点灯人的天地又十分狭小，除了点灯人他自己，不能容下第二个人。在地理学家的指点下，孤单的小王子来到人类居住的地球。\n小王子发现人类缺乏想象力，只知像鹦鹉那样重复别人讲过的话。小王子这时越来越思念自己星球上的那枝小玫瑰。后来，小王子遇到一只小狐狸，小王子用耐心征服了小狐狸，与它结成了亲密的朋友。小狐狸把自己心中的秘密——肉眼看不见事务的本质，只有用心灵才能洞察一切——作为礼物，送给小王子。用这个秘密，小王子在撒哈拉大沙漠与遇险的飞行员一起找到了生命的泉水。最后，小王子在蛇的帮助下离开地球，重新回到他的B612号小行星上。\n童话描写小王子没有被成人那骗人的世界所征服，而最终找到自己的理想。这理想就是连结宇宙万物的爱，而这种爱又是世间所缺少的。因此，小王子常常流露出一种伤感的情绪。作者圣埃克絮佩里在献辞中说：这本书是献给长成了大人的从前那个孩子。\n《小王子》不仅赢得了儿童读者，也为成年人所喜爱，作品凝练的语言渗透了作者对人类及人类文明深邃的思索。它所表现出的讽刺与幻想，真情与哲理，使之成为法国乃至世界上最为著名的一部童话小说。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s1144911.jpg','平凡的世界（全三部）','pingfandeshijiequansanbu','路遥','9787020049295','702004929X','','','人民文学出版社','','《平凡的世界》是一部现实主义小说，也是一部小说形式的家族史。作者浓缩了中国西北农村的历史变迁过程，在小说中全景式地表现了中国当代城乡的社会生活。在近十年的广阔背景下，通过复杂的矛盾纠葛，刻划社会各阶层众多普通人的形象。劳动与爱情，挫折与追求，痛苦与欢乐，日常生活与巨大社会冲突，纷繁地交织在一起，深刻地展示了普通人在大时代历史进程中所走过的艰难曲折的道路。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s1727290.jpg','追风筝的人','zhuifengzuoderen','[美] 卡勒德·胡赛尼','9787208061644','7208061645','','','上海人民出版社','','12岁的阿富汗富家少爷阿米尔与仆人哈桑情同手足。然而，在一场风筝比赛后，发生了一件悲惨不堪的事，阿米尔为自己的懦弱感到自责和痛苦，逼走了哈桑，不久，自己也跟随父亲逃往美国。\n成年后的阿米尔始终无法原谅自己当年对哈桑的背叛。为了赎罪，阿米尔再度踏上暌违二十多年的故乡，希望能为不幸的好友尽最后一点心力，却发现一个惊天谎言，儿时的噩梦再度重演，阿米尔该如何抉择？\n故事如此残忍而又美丽，作者以温暖细腻的笔法勾勒人性的本质与救赎，读来令人荡气回肠。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s5924326.jpg','简爱','jianai','[英] 夏洛蒂·勃朗特','9787506261579','750626157X','','','世界图书出版公司','','《简爱》是英国女作家夏洛蒂·勃朗特的代表作品。女主人公简爱是一个追赶求平等与自主的知识女性形象，小说以其感人的对于一位“灰姑娘式”人物奋斗史的刻划取胜，《简爱》也是女性文学的代表作品。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s1513548.jpg','莲花','lianhua','安妮宝贝','9787506335867','7506335867','','','作家出版社','','全书收录安妮墨脱之行所拍八张图片，皆沿途所见。\n《莲花》叙述年轻女子庆昭身患疾病，滞留高原，静等死亡。中年男人善生刚刚结束追名逐利的暄腾往日，内心长久压抑的黑暗苏醒，准备去与世隔绝的墨脱，寻访旧友内河。内河是被世界遗忘的女子，命运多舛。一路上善生向庆昭讲述自己和内河的往昔，雅鲁藏布江江河谷的奇崛险阻，恰似叙述中依次展开的一代人苦痛而流离的蜕变过程。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s4477716.jpg','1988：我想和这个世界谈谈','1988woxianghezhegeshijietantan','韩寒','9787512500983','751250098X','','','国际文化出版公司','','系列主题：《我想和这个世界谈谈》\n目前在韩寒主编的杂志《独唱团》中首度连载，这是韩寒预谋已久的一个系列，也是国内首度实际尝试“公路小说”这一概念的第一本——《1988》。\n所谓“公路小说”就是以路途为载体反应人生观，现实观的小说。\n如果说一件真正的艺术品的面世具有任何重大意义的话，韩寒新书的出版将会在中国创造一个历史事件，文章开头“空气越来越差，我必须上路了。我开着一台1988年出厂的旅行车，在说不清是迷雾还是毒气的夜色里拐上了318国道。”用一部旅行车为载体，通过在路上的见闻、过去的回忆、扑朔迷离的人物关系等各种现实场景，以韩寒本人对路上所见、所闻引发自己的观点，这场真正的旅途在精神层面；如果说似乎逾越了部分法律和道德的界限，但出发点也仅仅是希望在另一侧找到信仰。韩寒是“叛逆的”，他“试图用能给世界一些新意的眼光来看世界。试图寻找令人信服的价值”。他认为这一切通过文学都可以实现，产生了要创造一种批判现有一切社会习俗的“新幻象”的念头——《1988》就此问世。\n目前“公路小说”的系列已经开始策划，韩寒的作品首当其冲，韩寒表示将会撰写三部作品与聚石文华联合打造“公路小说”这一品牌',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s1228930.jpg','挪威的森林','nuoweidesenlin','[日] 村上春树','9787532725694','7532725693','','','上海译文出版社','','这是一部动人心弦的、平缓舒雅的、略带感伤的恋爱小说。小说主人公渡边以第一人称展开他同两个女孩间的爱情纠葛。渡边的第一个恋人直子原是他高中要好同学木月的女友，后来木月自杀了。一年后渡边同直子不期而遇并开始交往。此时的直子已变得娴静腼腆，美丽晶莹的眸子里不时掠过一丝难以捕捉的阴翳。两人只是日复一日地在落叶飘零的东京街头漫无目标地或前或后或并肩行走不止。直子20岁生日的晚上两人发生了性关系，不料第二天直子便不知去向。几个月后直子来信说她住进一家远在深山里的精神疗养院。渡边前去探望时发现直子开始带有成熟女性的丰腴与娇美。晚间两人虽同处一室，但渡边约束了自己，分手前表示永远等待直子。返校不久，由于一次偶然相遇，渡边开始与低年级的绿子交往。绿子同内向的直子截然相反，“简直就像迎着春天的晨光蹦跳到世界上来的一头小鹿”。这期间，渡边内心十分苦闷彷徨。一方面念念不忘直子缠绵的病情与柔情，一方面又难以抗拒绿子大胆的表白和迷人的活力。不久传来直子自杀的噩耗，渡边失魂魄地四处徒步旅行。最后，在直子同房病友玲子的鼓励下，开始摸索此后的人生。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s1091698.jpg','不能承受的生命之轻','bunengchengshoudeshengmingzhiqing','[捷克] 米兰·昆德拉','9787532731077','7532731073','','','上海译文出版社','','《不能承受的生命之轻》是米兰·昆德拉最负盛名的作品。小说描写了托马斯与特丽莎、萨丽娜之间的感情生活。但它不是一个男人和两个女人的三角性爱故事，它是一部哲理小说，小说从“永恒轮回”的讨论开始，把读者带入了对一系列问题的思考中，比如轻与重、灵与肉。\n《不能承受的生命之轻》是一部意象繁复的书，其中装载了多种涵义：被政治化了的社会内涵的揭示、人性考察、个人命运在特定历史与政治语境下的呈现，以及对两性关系本质上的探索等。昆德拉将这些元素糅合在一起，写成一部非同凡响的小说——其中既有隐喻式的哲学思考，也有人的悲欢离合的生命历程的展现。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s1444578.jpg','情人','qingren','[法] 玛格丽特·杜拉斯','9787532736874','7532736873','','','上海译文出版社','','杜拉斯代表作之一，自传性质的小说，获一九八四年法国龚古尔文学奖。全书以法国殖民者在越南的生活为背景，描写贫穷的法国女孩与富有的中国少爷之间深沉而无望的爱情。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s2659208.jpg','月亮和六便士','yueliangheliubianshi','[英] 毛姆','9787532739547','7532739546','','','上海译文出版社','','一个英国证券交易所的经纪人，本已有牢靠的职业和地位、美满的家庭，但却迷恋上绘画，像“被魔鬼附了体”，突然弃家出走，到巴黎去追求绘画的理想。他的行径没有人能够理解。他在异国不仅肉体受着贫穷和饥饿煎熬，而且为了寻找表现手法，精神亦在忍受痛苦折磨。经过一番离奇的遭遇后，主人公最后离开文明世界，远遁到与世隔绝的塔希提岛上。他终于找到灵魂的宁静和适合自己艺术气质的氛围。他同一个土著女子同居，创作出一幅又一幅使后世震惊的杰作。在他染上麻风病双目失明之前，曾在自己住房四壁画了一幅表现伊甸园的伟大作品。但在逝世之前，他却命令土著女子在他死后把这幅画作付之一炬。通过这样一个一心追求艺术、不通人性世故的怪才，毛姆探索了艺术的产生与本质、个性与天才的关系、艺术家与社会的矛盾等等引人深思的问题。同时这本书也引发了人们对摆脱世俗束缚逃离世俗社会寻找心灵家园这一话题的思考，而关于南太平洋小岛的自然民风的描写也引人向往。\n《月亮和六便士》说问世后，以情节入胜、文字深刻在文坛轰动一时，人们争相传看。在小说中，毛姆用第一人称的叙述手法，借“我”之口，叙述整个故事，有人认为这篇小说的原型是法国印象派画家高更，这更增加了它的传奇色彩，受到了全世界读者的关注。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s1077102.jpg','倾城之恋','qingchengzhilian','张爱玲','9787536023918','753602391X','','','花城出版社','','一对现实庸俗的男女，在战争的兵荒马乱之中被命运掷骰子般地掷到了一起，于“一刹那”体会到了“一对平凡的夫妻”之间的“一点真心”⋯⋯张爱玲是作为中国现代文学史上的一位杰出作家，而不是作为一个怪人、异人而存在的。也许她将不仅仅属于现代文学史。遥想几十年、几百年后，她会像她欣赏的李清照一样，在整个中国文学史上占据一个稳定的位置也说不定，而我们知道，那时候今天为我们所熟知的许多现代作家肯定都将被忽略不计了。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s28049685.jpg','岛上书店','daoshangshudian','[美] 加·泽文','9787539971810','7539971819','','','江苏凤凰文艺出版社','','岛上书店是间维多利亚风格的小屋，门廊上挂着褪色的招牌，上面写着： 没有谁是一座孤岛，每本书都是一个世界 A．J．费克里，人近中年，在一座与世隔绝的小岛上，经营一家书店。 命运从未眷顾过他，爱妻去世，书店危机，就连唯一值钱的宝贝也遭窃。他的人生陷入僵局，他的内心沦为荒岛。 就在此时，一个神秘的包袱出现在书店中，意外地拯救了陷于孤独绝境中的A．J．，成为了连接他和小姨子伊斯梅、警长兰比亚斯、出版社女业务员阿米莉娅之间的纽带，为他的生活带来了转机。 小岛上的几个生命紧紧相依，走出了人生的困境，而所有对书和生活的热爱都周而复始，愈加汹涌。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s23836852.jpg','活着','huozhuo','余华','9787544210966','7544210960','','','南海出版公司','','地主少爷福贵嗜赌成性，终于赌光了家业一贫如洗，穷困之中的福贵因为母亲生病前去求医，没想到半路上被国民党部队抓了壮丁，后被解放军所俘虏，回到家乡他才知道母亲已经去世，妻子家珍含辛茹苦带大了一双儿女，但女儿不幸变成了聋哑人，儿子机灵活泼……\n然而，真正的悲剧从此才开始渐次上演，每读一页，都让我们止不住泪湿双眼，因为生命里难得的温情将被一次次死亡撕扯得粉碎，只剩得老了的福贵伴随着一头老牛在阳光下回忆。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s6384944.jpg','百年孤独','bainiangudu','[哥伦比亚] 加西亚·马尔克斯','9787544253994','7544253996','','','南海出版公司','','《百年孤独》是魔幻现实主义文学的代表作，描写了布恩迪亚家族七代人的传奇故事，以及加勒比海沿岸小镇马孔多的百年兴衰，反映了拉丁美洲一个世纪以来风云变幻的历史。作品融入神话传说、民间故事、宗教典故等神秘因素，巧妙地糅合了现实与虚幻，展现出一个瑰丽的想象世界，成为20世纪最重要的经典文学巨著之一。1982年加西亚•马尔克斯获得诺贝尔文学奖，奠定世界级文学大师的地位，很大程度上乃是凭借《百年孤独》的巨大影响。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s11284102.jpg','霍乱时期的爱情','huoluanshiqideaiqing','[哥伦比亚] 加西亚·马尔克斯','9787544258975','7544258971','','','南海出版公司','','★马尔克斯唯一正式授权，首次完整翻译\n★《霍乱时期的爱情》是我最好的作品，是我发自内心的创作。——加西亚•马尔克斯\n★这部光芒闪耀、令人心碎的作品是人类有史以来最伟大的爱情小说。——《纽约时报》\n《霍乱时期的爱情》是加西亚•马尔克斯获得诺贝尔文学奖之后完成的第一部小说。讲述了一段跨越半个多世纪的爱情史诗，穷尽了所有爱情的可能性：忠贞的、隐秘的、粗暴的、羞怯的、柏拉图式的、放荡的、转瞬即逝的、生死相依的……再现了时光的无情流逝，被誉为“人类有史以来最伟大的爱情小说”，是20世纪最重要的经典文学巨著之一。',3,3,3,3),('A','A1','https://img3.doubanio.com/mpic/s27264181.jpg','解忧杂货店','jieyouzahuodian','[日] 东野圭吾','9787544270878','7544270874','','','南海出版公司','','现代人内心流失的东西，这家杂货店能帮你找回——\n僻静的街道旁有一家杂货店，只要写下烦恼投进卷帘门的投信口，第二天就会在店后的牛奶箱里得到回答。\n因男友身患绝症，年轻女孩静子在爱情与梦想间徘徊；克郎为了音乐梦想离家漂泊，却在现实中寸步难行；少年浩介面临家庭巨变，挣扎在亲情与未来的迷茫中……\n他们将困惑写成信投进杂货店，随即奇妙的事情竟不断发生。\n生命中的一次偶然交会，将如何演绎出截然不同的人生？\n如今回顾写作过程，我发现自己始终在思考一个问题：站在人生的岔路口，人究竟应该怎么做？我希望读者能在掩卷时喃喃自语：我从未读过这样的小说。——东野圭吾',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s24611679.jpg','文学回忆录（全2册）','wenxuehuiyiluquan2ce','木心 口述,陈丹青 笔录','9787549530816','7549530815','','','广西师范大学出版社','','文学是可爱的。生活是好玩的。艺术是要有所牺牲的。\n八十年代末，木心客居纽约时期，亦自他恢复写作、持续出书以来，纽约地面的大陆和台湾同行在异国谋饭之中，居然促成木心开讲“世界文学史”，忽忽长达五年的一场“文学的远征”——从1989年1月15日开课，到1994年1月9日最后一课，每位听课人轮流提供自家客厅，在座者有画家、舞蹈家、史家、雕刻家等等。\n听课学生陈丹青说，“我们当年这样地胡闹一场，回想起来，近于荒谬的境界：没有注册，没有教室，没有课本，没有考试与证书，更没有赞助与课题费，不过是在纽约市皇后区、曼哈顿区、布鲁克林区的不同寓所中，团团坐拢来，听木心神聊。”\n菜单开出来，大家选。从古希腊神话、新旧约，到诗经、楚辞，从中世纪欧洲文学，到二十世纪文学世界，东方西方通讲，知识灵感并作。其中听的听，讲的讲，“金句”纷披，兀自燃烧。“讲完后，一部文学史，重要的是我的观点。”木心说。古代，中世纪，近代，每个时代都能找到精神血统，艺术亲人。\n他爱先秦典籍，只为诸子的文学才华；他以为今日所有伪君子身上，仍然活着孔丘；他想对他爱敬的尼采说：从哲学跑出来吧；他激赏拜伦、雪莱、海涅，却说他们其实不太会作诗；他说托尔斯泰可惜“头脑不行”，但讲到托翁坟头不设十字架，不设墓碑，忽而语音低弱了，颤声说：“伟大！”而谈及萨特的葬礼，木心脸色一正，引尼采的话：唯有戏子才能唤起群众巨大的兴奋。\n木心开讲时六十二岁。多少民国书籍与读者，湮灭了。他的一生，密集伴随愈演愈烈的文化断层。他不肯断，而居然不曾断，这就是纽约世界文学史讲座潜藏的背景：在累累断层之间、之外、之后，木心始终将自己尽可能置于世界性的文学景观，倘若不是出走，这顽强而持久的挣扎，几乎濒于徒劳。\n如今，听课学生陈丹青整理那五年那五册听课笔记，共八十五讲，逾四十万字，结集这本大书时，已不再将之仅仅看做“世界文学史讲座”。诚如木心所最早时设想的那样，这是他自己的“文学回忆录”，是一部“荒诞小说”，“在自己的身上，克服这个时代”。\n这也是木心留给世界的礼物，文学的福音书。\n本书首次披露的木心先生及其亲属的珍贵照片，由陈丹青先生和木心的外甥王韦先生提供。附印民国版本的世界文学书影，是一部民国出版史的私人旁证。',3,3,3,3),('A','A1','https://img1.doubanio.com/mpic/s1078958.jpg','飘','piao','[美国] 玛格丽特·米切尔','9787806570920','7806570926','','','译林出版社','','小说中的故事发生在1861年美国南北战争前夕。生活在南方的少女郝思嘉从小深受南方文化传统的熏陶，可在她的血液里却流淌着野性的叛逆因素。随着战火的蔓廷和生活环境的恶化，郝思嘉的叛逆个性越来越丰满，越鲜明，在一系列的的挫折中她改造了自我，改变了个人甚至整个家族的命运，成为时代时势造就的新女性的形象。\n作品在描绘人物生活与爱情的同时，勾勒出南北双方在政治，经济，文化各个层次的异同，具有浓厚的史诗风格，堪称美国历史转折时期的真实写照，同时也成为历久不衰的爱情经典。',3,3,3,3);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `book_brw`
--

DROP TABLE IF EXISTS `book_brw`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book_brw` (
  `barcode` char(16) NOT NULL,
  `orderid` char(20) NOT NULL,
  `borrowtime` datetime DEFAULT NULL,
  `returntime` datetime DEFAULT NULL,
  `mark` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`barcode`,`orderid`),
  CONSTRAINT `book_brw_ibfk_1` FOREIGN KEY (`barcode`) REFERENCES `book_mng` (`barcode`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book_brw`
--

LOCK TABLES `book_brw` WRITE;
/*!40000 ALTER TABLE `book_brw` DISABLE KEYS */;
/*!40000 ALTER TABLE `book_brw` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `book_mng`
--

DROP TABLE IF EXISTS `book_mng`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `book_mng` (
  `isbn13` char(13) NOT NULL,
  `barcode` char(16) NOT NULL,
  `location` varchar(31) DEFAULT NULL,
  `state` int(11) NOT NULL DEFAULT '4',
  PRIMARY KEY (`barcode`),
  KEY `isbn13` (`isbn13`),
  CONSTRAINT `book_mng_ibfk_1` FOREIGN KEY (`isbn13`) REFERENCES `book` (`isbn13`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book_mng`
--

LOCK TABLES `book_mng` WRITE;
/*!40000 ALTER TABLE `book_mng` DISABLE KEYS */;
INSERT INTO `book_mng` VALUES ('9787020002207','9787020002207001','国家图书馆',4),('9787020002207','9787020002207002','北京市图书馆',4),('9787020002207','9787020002207003','北京理工大学图书馆',4),('9787020024759','9787020024759001','国家图书馆',4),('9787020024759','9787020024759002','北京市图书馆',4),('9787020024759','9787020024759003','北京理工大学图书馆',4),('9787020042494','9787020042494001','国家图书馆',4),('9787020042494','9787020042494002','北京市图书馆',4),('9787020042494','9787020042494003','北京理工大学图书馆',4),('9787020049295','9787020049295001','国家图书馆',4),('9787020049295','9787020049295002','北京市图书馆',4),('9787020049295','9787020049295003','北京理工大学图书馆',4),('9787208061644','9787208061644001','国家图书馆',4),('9787208061644','9787208061644002','北京市图书馆',4),('9787208061644','9787208061644003','北京理工大学图书馆',4),('9787506261579','9787506261579001','国家图书馆',4),('9787506261579','9787506261579002','北京市图书馆',4),('9787506261579','9787506261579003','北京理工大学图书馆',4),('9787506335867','9787506335867001','国家图书馆',4),('9787506335867','9787506335867002','北京市图书馆',4),('9787506335867','9787506335867003','北京理工大学图书馆',4),('9787512500983','9787512500983001','国家图书馆',4),('9787512500983','9787512500983002','北京市图书馆',4),('9787512500983','9787512500983003','北京理工大学图书馆',4),('9787532725694','9787532725694001','国家图书馆',4),('9787532725694','9787532725694002','北京市图书馆',4),('9787532725694','9787532725694003','北京理工大学图书馆',4),('9787532731077','9787532731077001','国家图书馆',4),('9787532731077','9787532731077002','北京市图书馆',4),('9787532731077','9787532731077003','北京理工大学图书馆',4),('9787532736874','9787532736874001','国家图书馆',4),('9787532736874','9787532736874002','北京市图书馆',4),('9787532736874','9787532736874003','北京理工大学图书馆',4),('9787532739547','9787532739547001','国家图书馆',4),('9787532739547','9787532739547002','北京市图书馆',4),('9787532739547','9787532739547003','北京理工大学图书馆',4),('9787536023918','9787536023918001','国家图书馆',4),('9787536023918','9787536023918002','北京市图书馆',4),('9787536023918','9787536023918003','北京理工大学图书馆',4),('9787539971810','9787539971810001','国家图书馆',4),('9787539971810','9787539971810002','北京市图书馆',4),('9787539971810','9787539971810003','北京理工大学图书馆',4),('9787544210966','9787544210966001','国家图书馆',4),('9787544210966','9787544210966002','北京市图书馆',4),('9787544210966','9787544210966003','北京理工大学图书馆',4),('9787544253994','9787544253994001','国家图书馆',4),('9787544253994','9787544253994002','北京市图书馆',4),('9787544253994','9787544253994003','北京理工大学图书馆',4),('9787544258975','9787544258975001','国家图书馆',4),('9787544258975','9787544258975002','北京市图书馆',4),('9787544258975','9787544258975003','北京理工大学图书馆',4),('9787544270878','9787544270878001','国家图书馆',4),('9787544270878','9787544270878002','北京市图书馆',4),('9787544270878','9787544270878003','北京理工大学图书馆',4),('9787549530816','9787549530816001','国家图书馆',4),('9787549530816','9787549530816002','北京市图书馆',4),('9787549530816','9787549530816003','北京理工大学图书馆',4),('9787806570920','9787806570920001','国家图书馆',4),('9787806570920','9787806570920002','北京市图书馆',4),('9787806570920','9787806570920003','北京理工大学图书馆',4);
/*!40000 ALTER TABLE `book_mng` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cart` (
  `userid` int(11) NOT NULL,
  `barcode` char(16) NOT NULL,
  PRIMARY KEY (`userid`,`barcode`),
  KEY `barcode` (`barcode`),
  CONSTRAINT `cart_ibfk_1` FOREIGN KEY (`barcode`) REFERENCES `book_mng` (`barcode`),
  CONSTRAINT `cart_ibfk_2` FOREIGN KEY (`userid`) REFERENCES `user` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
INSERT INTO `cart` VALUES (1,'9787020002207001'),(1,'9787020024759001'),(1,'9787020049295001'),(1,'9787208061644001'),(1,'9787512500983001'),(1,'9787532725694001'),(1,'9787532731077001'),(1,'9787532739547001'),(1,'9787536023918001'),(1,'9787539971810001'),(1,'9787544210966001'),(1,'9787544253994001'),(1,'9787544270878001'),(1,'9787549530816001');
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `comment` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `userid` int(11) NOT NULL,
  `isbn13` char(13) NOT NULL,
  `comment` text,
  `grade` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `isbn13` (`isbn13`),
  KEY `userid` (`userid`),
  CONSTRAINT `comment_ibfk_1` FOREIGN KEY (`isbn13`) REFERENCES `book` (`isbn13`),
  CONSTRAINT `comment_ibfk_2` FOREIGN KEY (`userid`) REFERENCES `user` (`userid`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (1,1,'9787208061644','good',5),(2,1,'9787208061644','not bad',3),(3,1,'9787208061644','bad',1),(4,1,'9787544253994','good',5),(5,1,'9787544253994','not bad',3),(6,1,'9787544253994','bad',1),(7,1,'9787532731077','good',5),(8,1,'9787532731077','not bad',3),(9,1,'9787532731077','bad',1),(10,1,'9787020049295','good',5),(11,1,'9787020049295','not bad',3),(12,1,'9787020049295','bad',1),(13,1,'9787020024759','good',5),(14,1,'9787020024759','not bad',3),(15,1,'9787020024759','bad',1),(16,1,'9787544210966','good',5),(17,1,'9787544210966','not bad',3),(18,1,'9787544210966','bad',1),(19,1,'9787020042494','good',5),(20,1,'9787020042494','not bad',3),(21,1,'9787020042494','bad',1),(22,1,'9787549530816','good',5),(23,1,'9787549530816','not bad',3),(24,1,'9787549530816','bad',1),(25,1,'9787020002207','good',5),(26,1,'9787020002207','not bad',3),(27,1,'9787020002207','bad',1),(28,1,'9787532725694','good',5),(29,1,'9787532725694','not bad',3),(30,1,'9787532725694','bad',1),(31,1,'9787544270878','good',5),(32,1,'9787544270878','not bad',3),(33,1,'9787544270878','bad',1),(34,1,'9787512500983','good',5),(35,1,'9787512500983','not bad',3),(36,1,'9787512500983','bad',1),(37,1,'9787536023918','good',5),(38,1,'9787536023918','not bad',3),(39,1,'9787536023918','bad',1),(40,1,'9787539971810','good',5),(41,1,'9787539971810','not bad',3),(42,1,'9787539971810','bad',1),(43,1,'9787532739547','good',5),(44,1,'9787532739547','not bad',3),(45,1,'9787532739547','bad',1),(46,1,'9787532736874','good',5),(47,1,'9787532736874','not bad',3),(48,1,'9787532736874','bad',1),(49,1,'9787544258975','good',5),(50,1,'9787544258975','not bad',3),(51,1,'9787544258975','bad',1),(52,1,'9787506261579','good',5),(53,1,'9787506261579','not bad',3),(54,1,'9787506261579','bad',1),(55,1,'9787806570920','good',5),(56,1,'9787806570920','not bad',3),(57,1,'9787806570920','bad',1),(58,1,'9787506335867','good',5),(59,1,'9787506335867','not bad',3),(60,1,'9787506335867','bad',1);
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `orderlist`
--

DROP TABLE IF EXISTS `orderlist`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `orderlist` (
  `userid` int(11) NOT NULL,
  `isbn13` char(13) NOT NULL,
  `ordertime` datetime NOT NULL,
  `mark` int(11) NOT NULL DEFAULT '1',
  KEY `isbn13` (`isbn13`),
  KEY `userid` (`userid`),
  CONSTRAINT `orderlist_ibfk_1` FOREIGN KEY (`isbn13`) REFERENCES `book` (`isbn13`),
  CONSTRAINT `orderlist_ibfk_2` FOREIGN KEY (`userid`) REFERENCES `user` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orderlist`
--

LOCK TABLES `orderlist` WRITE;
/*!40000 ALTER TABLE `orderlist` DISABLE KEYS */;
/*!40000 ALTER TABLE `orderlist` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ordertable`
--

DROP TABLE IF EXISTS `ordertable`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ordertable` (
  `userid` int(11) NOT NULL,
  `orderid` char(20) NOT NULL,
  `ordertime` datetime DEFAULT NULL,
  `orderstate` int(11) DEFAULT '1',
  PRIMARY KEY (`orderid`),
  KEY `userid` (`userid`),
  CONSTRAINT `ordertable_ibfk_1` FOREIGN KEY (`userid`) REFERENCES `user` (`userid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ordertable`
--

LOCK TABLES `ordertable` WRITE;
/*!40000 ALTER TABLE `ordertable` DISABLE KEYS */;
/*!40000 ALTER TABLE `ordertable` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `t_base_pinyin`
--

DROP TABLE IF EXISTS `t_base_pinyin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `t_base_pinyin` (
  `pin_yin_` varchar(255) CHARACTER SET gbk NOT NULL,
  `code_` int(11) NOT NULL,
  PRIMARY KEY (`code_`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `t_base_pinyin`
--

LOCK TABLES `t_base_pinyin` WRITE;
/*!40000 ALTER TABLE `t_base_pinyin` DISABLE KEYS */;
INSERT INTO `t_base_pinyin` VALUES ('zuo',10254),('zun',10256),('zui',10260),('zuan',10262),('zu',10270),('zou',10274),('zong',10281),('zi',10296),('zhuo',10307),('zhun',10309),('zhui',10315),('zhuang',10322),('zhuan',10328),('zhuai',10329),('zhua',10331),('zhu',10519),('zhou',10533),('zhong',10544),('zhi',10587),('zheng',10764),('zhen',10780),('zhe',10790),('zhao',10800),('zhang',10815),('zhan',10832),('zhai',10838),('zha',11014),('zeng',11018),('zen',11019),('zei',11020),('ze',11024),('zao',11038),('zang',11041),('zan',11045),('zai',11052),('za',11055),('yun',11067),('yue',11077),('yuan',11097),('yu',11303),('you',11324),('yong',11339),('yo',11340),('ying',11358),('yin',11536),('yi',11589),('ye',11604),('yao',11781),('yang',11798),('yan',11831),('ya',11847),('xun',11861),('xue',11867),('xuan',12039),('xu',12058),('xiu',12067),('xiong',12074),('xing',12089),('xin',12099),('xie',12120),('xiao',12300),('xiang',12320),('xian',12346),('xia',12359),('xi',12556),('wu',12585),('wo',12594),('weng',12597),('wen',12607),('wei',12802),('wang',12812),('wan',12829),('wai',12831),('wa',12838),('tuo',12849),('tun',12852),('tui',12858),('tuan',12860),('tu',12871),('tou',12875),('tong',12888),('ting',13060),('tie',13063),('tiao',13068),('tian',13076),('ti',13091),('teng',13095),('te',13096),('tao',13107),('tang',13120),('tan',13138),('tai',13147),('ta',13318),('suo',13326),('sun',13329),('sui',13340),('suan',13343),('su',13356),('sou',13359),('song',13367),('si',13383),('shuo',13387),('shun',13391),('shui',13395),('shuang',13398),('shuan',13400),('shuai',13404),('shua',13406),('shu',13601),('shou',13611),('shi',13658),('sheng',13831),('shen',13847),('she',13859),('shao',13870),('shang',13878),('shan',13894),('shai',13896),('sha',13905),('seng',13906),('sen',13907),('se',13910),('sao',13914),('sang',13917),('san',14083),('sai',14087),('sa',14090),('ruo',14092),('run',14094),('rui',14097),('ruan',14099),('ru',14109),('rou',14112),('rong',14122),('ri',14123),('reng',14125),('ren',14135),('re',14137),('rao',14140),('rang',14145),('ran',14149),('qun',14151),('que',14159),('quan',14170),('qu',14345),('qiu',14353),('qiong',14355),('qing',14368),('qin',14379),('qie',14384),('qiao',14399),('qiang',14407),('qian',14429),('qia',14594),('qi',14630),('pu',14645),('po',14654),('ping',14663),('pin',14668),('pie',14670),('piao',14674),('pian',14678),('pi',14857),('peng',14871),('pen',14873),('pei',14882),('pao',14889),('pang',14894),('pan',14902),('pai',14908),('pa',14914),('ou',14921),('o',14922),('nuo',14926),('nue',14928),('nuan',14929),('nv',14930),('nu',14933),('nong',14937),('niu',14941),('ning',15109),('nin',15110),('nie',15117),('niao',15119),('niang',15121),('nian',15128),('ni',15139),('neng',15140),('nen',15141),('nei',15143),('ne',15144),('nao',15149),('nang',15150),('nan',15153),('nai',15158),('na',15165),('mu',15180),('mou',15183),('mo',15362),('miu',15363),('ming',15369),('min',15375),('mie',15377),('miao',15385),('mian',15394),('mi',15408),('meng',15416),('men',15419),('mei',15435),('me',15436),('mao',15448),('mang',15454),('man',15625),('mai',15631),('ma',15640),('luo',15652),('lun',15659),('lue',15661),('luan',15667),('lv',15681),('lu',15701),('lou',15707),('long',15878),('liu',15889),('ling',15903),('lin',15915),('lie',15920),('liao',15933),('liang',15944),('lian',15958),('lia',15959),('li',16155),('leng',16158),('lei',16169),('le',16171),('lao',16180),('lang',16187),('lan',16202),('lai',16205),('la',16212),('kuo',16216),('kun',16220),('kui',16393),('kuang',16401),('kuan',16403),('kuai',16407),('kua',16412),('ku',16419),('kou',16423),('kong',16427),('keng',16429),('ken',16433),('ke',16448),('kao',16452),('kang',16459),('kan',16465),('kai',16470),('ka',16474),('jun',16647),('jue',16657),('juan',16664),('ju',16689),('jiu',16706),('jiong',16708),('jing',16733),('jin',16915),('jie',16942),('jiao',16970),('jiang',16983),('jian',17185),('jia',17202),('ji',17417),('huo',17427),('hun',17433),('hui',17454),('huang',17468),('huan',17482),('huai',17487),('hua',17496),('hu',17676),('hou',17683),('hong',17692),('heng',17697),('hen',17701),('hei',17703),('he',17721),('hao',17730),('hang',17733),('han',17752),('hai',17759),('ha',17922),('guo',17928),('gun',17931),('gui',17947),('guang',17950),('guan',17961),('guai',17964),('gua',17970),('gu',17988),('gou',17997),('gong',18012),('geng',18181),('gen',18183),('gei',18184),('ge',18201),('gao',18211),('gang',18220),('gan',18231),('gai',18237),('ga',18239),('fu',18446),('fou',18447),('fo',18448),('feng',18463),('fen',18478),('fei',18490),('fang',18501),('fan',18518),('fa',18526),('er',18696),('en',18697),('e',18710),('duo',18722),('dun',18731),('dui',18735),('duan',18741),('du',18756),('dou',18763),('dong',18773),('diu',18774),('ding',18783),('die',18952),('diao',18961),('dian',18977),('di',18996),('deng',19003),('de',19006),('dao',19018),('dang',19023),('dan',19038),('dai',19212),('da',19218),('cuo',19224),('cun',19227),('cui',19235),('cuan',19238),('cu',19242),('cou',19243),('cong',19249),('ci',19261),('chuo',19263),('chun',19270),('chui',19275),('chuang',19281),('chuan',19288),('chuai',19289),('chu',19467),('chou',19479),('chong',19484),('chi',19500),('cheng',19515),('chen',19525),('che',19531),('chao',19540),('chang',19715),('chan',19725),('chai',19728),('cha',19739),('ceng',19741),('ce',19746),('cao',19751),('cang',19756),('can',19763),('cai',19774),('ca',19775),('bu',19784),('bo',19805),('bing',19976),('bin',19982),('bie',19986),('biao',19990),('bian',20002),('bi',20026),('beng',20032),('ben',20036),('bei',20051),('bao',20230),('bang',20242),('ban',20257),('bai',20265),('ba',20283),('ao',20292),('ang',20295),('an',20304),('ai',20317),('a',20319);
/*!40000 ALTER TABLE `t_base_pinyin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `userid` int(11) NOT NULL AUTO_INCREMENT,
  `tel` char(20) DEFAULT NULL,
  `unionid` varchar(63) DEFAULT NULL,
  `degree` int(11) DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `email` varchar(63) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `postcode` char(6) DEFAULT NULL,
  `name` varchar(31) DEFAULT NULL,
  `certificate` int(11) DEFAULT NULL,
  `certificateid` varchar(31) DEFAULT NULL,
  `recommendFrequency` int(8) DEFAULT NULL,
  PRIMARY KEY (`userid`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'18210189279','novas_ghost',4,'1996-05-22','tongqinw@163.com','3#_114','100086','仝秦玮',1,'150203199605222137',0);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-06-27 15:35:54
